1.今日课上练习内容敲2遍以上

2.通过代码来验证name变量是什么数据类型？

name = input(">>>")
3.if条件语句的基本结构？

4.用print打印出下面内容：

文能提笔安天下,
武能上马定乾坤.
心存谋略何人胜,
古今英雄唯世君.
5.简述=和==的区别?

6.利用if语句写出猜大小的游戏:(15分)

设定一个理想数字比如：66，让用户输入数字，如果比66大，则显示猜测的结果大了；如果比66小，则显示猜测的结果小了;只有等于66，显示猜测结果正确。

7.提⽰⽤户输入年龄, 通过程序进⾏判断. (20分钟)

如果小于10,提示小屁孩,如果大于10,小于20,提示青春期叛逆的小屁孩.如果大于20,小于30.提示开始定性,开始混社会小屁孩儿,如果大于30,小于40.提示看老老大不了,赶紧结婚小屁孩儿.如果大于40,小于50.提示家里有个不听话的小屁孩儿.如果大于50,小于60.提示自己马上变成不听话的老屁孩儿.如果大于60,小于70.提示活着还不错的老屁孩儿.如果大于70,小于90.提示人生就快结束了的一个老屁孩儿.如果大于90以上.提示再见了这个世界.

8.单行注释以及多行注释？(3分钟)

9.简述你所知道的Python3x和Python2x的区别？(5分钟)

10.提示用户输入的麻花藤. 判断用户输入的是否正确. 如果对, 提示真聪明, 如果不对, 提示用户输入错误(15分钟)

11.模拟智能移动客服,首先给用户展示一下功能选项(20分钟)

1.查询剩余主动呼叫分钟
2.查询本地流量余额
3.查询全国流量余额
4.查询短信剩余条数
5.查询当前套餐
6.变更套餐
7.查询话费余额
8.查看缴费记录
用户输入序号给用户输出对应的功能!

12.用户输入一个分数.根据分数来判断用户考试成绩的输出不同的档次(20分钟)

>=90         A
>=80         B
>=70         C
>=60         D
< 60        不及格
13.模拟QQ登录,让用户输入账号密码.将获取到的账号和密码与(20分钟)

账号: alex
密码: alex3714
进行校验.账号和密码都正确后提示登录成功,否则提示账号密码错误!

14.模拟QQ登录,持续让用户输入账号密码.将获取到的账号和密码与(30分钟)

账号: alex
密码: alex3714
进行校验.账号和密码都正确后提示登录成功并终止循环,否则提示账号或密码错误并重新登录!