以下作业尽量保证是独立完成,尽量不参考笔记和问同学
1.判断下列逻辑语句的结果,一定要自己先分析 (5分钟)
1）1 > 1 or 3 < 4 or 4 > 5 and 2 > 1 and 9 > 8 or 7 < 6
2）not 2 > 1 and 3 < 4 or 4 > 5 and 2 > 1 and 9 > 8 or 7 < 6

2.求出下列逻辑语句的值,一定要自己分析(10分钟)
1)8 or 3 and 4 or 2 and 0 or 9 and 7
2)0 or 2 and 3 and 4 or 6 and 0 or 3
3)1 and 0 or 8 and 9 and 5 or 2
4)4 or 8 and not False and 8 or 9

3.下列结果是什么? (10分钟)

6 or 2 > 1
3 or 2 > 1
0 or 5 < 4
5 < 4 or 3
2 > 1 or 6
3 and 2 > 1
0 and 3 > 1
2 > 1 and 3
3 > 1 and 0
3 > 1 and 2 or 2 < 3 and 3 and 4 or 3 > 2
4.简述ASCII、Unicode、utf-8编码英文,中文个占用多少字节(5分钟)

5.简述位和字节的关系？(3分钟)

6.while循环语句基本结构？(3分钟)

7.利用while语句写出猜大小的游戏：(15分钟)
设定一个理想数字比如：66，让用户输入数字，如果比66大，则显示猜测的结果大了；如果比66小，则显示猜测的结果小了;只有等于66，显示猜测结果正确，然后退出循环。

8.在7题的基础上进行升级：(20分钟)
给用户三次猜测机会，如果三次之内猜测对了，则显示猜测正确，退出循环，如果三次之内没有猜测正确，则自动退出循环，并显示‘太笨了你....’。

9.使用while循环输出 1 2 3 4 5 6 8 9 10 (20分钟)

10.求1-100的所有数的和 (10分钟)

11.输出 1-100 内的所有奇数(10分钟)

12.输出 1-100 内的所有偶数(10分钟)

13.求1-2+3-4+5 ... 99的所有数的和 (30分钟)

14.⽤户登陆（三次输错机会）且每次输错误时显示剩余错误次数（提示：使⽤字符串格式化）(20分钟)